CanCategoryBeHidden Method
 Checks whether the category can be hidden in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool CanCategoryBeHidden(
	ElementId elementId
)
Visual Basic
Public Function CanCategoryBeHidden ( _
	elementId As ElementId _
) As Boolean
Visual C++
public:
bool CanCategoryBeHidden(
	ElementId^ elementId
)
Parameters
elementId
Type: Autodesk.Revit.DBElementId
 ElementId of the category.
Return Value
 True if the category can be hidden, false otherwise.
Remarks
 Categories can be allowed to be hidden in some view types and prohibited from being hidden in others. E.g., categories cannot be hidden in ProjectBrowser
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →